namespace Domain.Enums
{
    /// <summary>
    /// Представляет возможные статусы электронного билета в системе.
    /// </summary>
    public enum ETicketStatus
    {
        /// <summary>
        /// Билет активен, оплачен и действителен для использования.
        /// Клиент может пройти по нему на мероприятие/рейс, а также обменять или вернуть.
        /// </summary>
        Active,

        /// <summary>
        /// Билет успешно использован.
        /// Контроллер или турникет отсканировали билет. Повторный проход, обмен или возврат невозможны.
        /// </summary>
        Used,

        /// <summary>
        /// Билет аннулирован.
        /// Блокировка без стандартного возврата средств (например, при отмене самого мероприятия, 
        /// подозрении в мошенничестве или ошибке выпуска). Проход по нему закрыт.
        /// </summary>
        Void,

        /// <summary>
        /// Билет возвращен.
        /// Клиент оформил возврат, и средства за билет (полностью или частично) отправлены обратно. 
        /// Билет больше недееспособен.
        /// </summary>
        Refunded
    }

}